; TaskSwitchXP Pro 2.05 English Language File (Template)
; Translated by Alexander Avdonin <alexander@ntwind.com>


; TaskSwitchXP enumerates all *.LNG files into .\lang subfolder!
; To add a language for TaskSwitchXP:
;     1) translate this file;
;     2) save it as <NewLanguage>.lng in UNICODE format
;        (for Notepad: select File->Save_As and then choose Unicode encoding);
;     3) test it before submitting!!!
;
; Translations forum/tracker: http://www.ntwind.com/forum/viewforum.php?f=3
;
; I will include some translations to my official release (if you accept!)...
; Please put your e-mail address for feedback somewhere!


; There are a few special characters (two symbols are recognized as one):
;     1) carriage return and new line:  \r\n
;     2) tab:  \t
;     3) quotation mark:  \"
;     4) back slash:  \\


; NOTE: These language files will generally work with future versions of 
;       TaskSwitchXP, but some strings will appear in English. I will put a 
;       change log for future versions in the comments of this file.


; Currently TaskSwitchXP uses *.LNG file names for language identifying.
; This string is ignored. Please put here for future versions:
;     19999="English_LanguageName (Native_LanguageName)"
;     e.g. 19999="German (Deutsch)"
19999="English"


; Cofiguration
20000="Nastavenia TaskSwitchXP Pro 2.0"
20001="OK"
20002="Zrušiť"
20003="Použiť"

; Filters
20031="Konfiguračné súbory TaskSwitchXP(*.cfg)"


; Pages
20050="Obecné"
20051="Vzhľad"
20052="Zoznam okien"
20053="Náhľad"
20054="Info o programoch"
20055="Klávesové skratky"
20056="Výnimky"
20057="Pokročilé"
20058="O programe..."

; Page descriptions
20070="Obecné nastavenia"
20071="Nastavenia Vzhľadu"
20072="Zoznam otvorených okien"
20073="Nastavenia náhľadu"
20074="Informácie o spustených programoch"
20075="Klávesové skratky TaskSwitchXP"
20076="TaskSwitchXP výnimky"
20077="Pokročilé nastavenia"
20078="O programe TaskSwitchXP"


; General page
20100="Jazyk:"
20101="<a id=\"idLang\" href=\"\">Nájsť viac jazykov...</a>"
20102="Použiť osobitné nastavenia pre každého užívateľa"
20103="Automaticky spustiť TaskSwitchXP pri štarte systému"
20104="Nastaviť vysokú prioritu pre TaskSwitchXP"
20105="Skontrolovať či je spustený Ms PowerToy TaskSwitcher"
20106="Tray ikony:"
20107="Zobraziť TaskSwitchXP tray ikonu pri štarte"
20108="Použiť vlastnú ikonu:"
20109="Minimalizovať okná do tray pravým kliknutím na tlačidlo minimalizovať"
20110="Zabezpečiť TaskSwitchXP tray ikony pred automatickým skrývaním"
20111="Pridať okná minimalizované do tray na koniec Alt-Tab zoznamu"

20120="Obnoviť pôvodné"
20121="Otvoriť..."
20122="Uložiť..."

; Appearance page
20200="Umiestnenie na obrazovke:"
20201="Zobraziť na aktívnom monitore"
20202="Použiť tieň pre TaskSwitchXP okno"
20203="Povoliť priehľadnosť pre TaskSwitchXP okno:"
20204="Povoliť animáciu zosvetlenia (v millisekundách):"
20205="Povoliť animáciu strácania (v millisekundách):"
20206="Uprednostňované vykresľovacie módy:"
20207="Vzhľad XP:"
20208="Klasický vzhľad:"
20209="Donútiť používať TaskSwitchXP klasický štýl"
20210="Usporiadanie panelov zľava do prava"

; Position on screen
20270="Navrchu - Vľavo"
20271="Navrchu - V strede"
20272="Navrchu - Vpravo"
20273="V strede - Vľavo"
20274="V strede"
20275="V strede - Vpravo"
20276="Naspodu - Vľavo"
20277="Naspodu - V strede"
20278="Naspodu - Vpravo"

; Modern XP skins
20280="Panel štart štýl (defaultný)"
20281="PowerToy TaskSwitcher štýl"
20282="Jednoduché okno"
20283="Plochý XP štýl"
20284="Jemný XP štýl"
20285="Štýl panelu úloh"

; Classical skins
20290="Panel štart štýl (defaultný)"
20291="Plochý štart panel štýl"


; Task List page
20300="Zobrazenie zoznamu:"
20301="Počet stĺpcov:"
20302="Šírka (v pixeloch):"
20303="Počet riadkov:"
20304="Malé ikony"
20305="Povoliť bublinovú nápovedu pre zoznam úloh"
20306="Pri výbere použiť kurzor myši-ručičku"
; or something like 20307="Enable mouse over selection", 
; I've translated it to Russian as: 20307="Select list item under cursor"
20307="Výber položky prechodom myši"
20308="Inverzné koliečko myši"
20309="Štýl výberu:"
20310="Obdĺžnik okolo vybratej položky"
20311="Štýl textu a farby:"
20312="Písmo:"
20313="Veľkosť:"
20314="B"
20315="I"
20316="Farby:"

; List views
20390="Ikony"
20391="Vertikálny zoznam"

; Selection styles
20380="Rám"
20381="Vyplnený obdĺžnik"
20382="Oblý obdĺžnik"

; Color indexes
20370="Text"
20371="Vybratý text"
20372="Pozadie výberu"
20373="Označený text 1"
20374="Označené pozadie 1"
20375="Označený text 2"
20376="Označené pozadie 2"


; Preview page
20400="Typ náhľadu:"
20401="\"Desktop\" štýl náhľadu"
20402="\"Window\" štýl náhľadu"
20403="Zahrnúť panel úloh do náhľadu"
20404="Zobraziť iba posledné vrchné okno aplikácie"
20405="Nezobrazovať pozadie pracovnej plochy v náhľade"
20406="Obrázok pracovnej plochy ako pozadie"
20407="Okraj okolo náhľadu"
20408="Vycentrovať náhľad vertikálne"
20409="Zobraziť legendu minimalizovaných okien v náhľade(*)"
20410="Vynechať všetky podokná z náhľadu (*)"
20411="šírka obrázku náhľadu (v pixeloch):"
20412="Oneskorenie zobrazenia prvého náhľadu (v millisekundách):"
20413="Neukladať obrázky náhľadu do medzipamäte"
20414="Povoliť obnovovanie náhľadu (v milisekundách):"


; Info page
20500="Záhlavie TaskSwitchXP okna:"
20501="Písmo:"
20502="Veľkosť:"
20503="B"
20504="I"
20505="Farba:"
20506="Tieň:"
20507="Hĺbka:"
20508="Farba:"
20509="Zobraziť ikonu programu v záhlaví"
20510="Použiť malé záhlavie"
20511="Stavový riadok:"
20512="Písmo:"
20513="Veľkosť:"
20514="B"
20515="I"
20516="Farba:"
20517="Tieň:"
20518="Hĺbka:"
20519="Farba:"
20520="Výška:"
20521="Formát:"

; Info formats
20590="Žiaden"
20591="Iba číslo"
20592="ID procesu"
20593="Meno procesu"
20594="Meno procesu  [PID]"
20595="Opis programu"


; Hotkeys page
20600="Nahradiť štandardný Alt-Tab prepínač"
20601="Prepínač okien jedného programu Ctrl+Alt+[Shift]+Tab"
; or something like 20602="Don't hide TaskSwitchXP window on Alt releasing"
20602="Po stlačení Alt-Tab zostane okno TaskSwitchXP zobrazené"
; or something like 20603="Use low-level method to replace Alt-Tab"
20603="Použiť nevynútený spôsob nahradenia Alt-Tab"
20604="Ovládanie TaskSwitchXP:"
20605="Okná všetkých aplikácií:"
20606="Okná aktívnej aplikácie:"
20607="Nastaviť TaskSwitchXP:"
20608="Zobraziť/Skryť tray ikonu:"
20609="Ukončiť TaskSwitchXP:"
20610="Doplnkové klávesové skratky:"
20611="Minimalizovať okno do tray:"
20612="Obnoviť z tray:"


; Exclusions page
20700="Nová..."
20701="Upraviť..."
20702="Odstrániť"

; List groups
20780="Náhľad zobrazenia"
20781="Zobrazenie okna v zozname"

20790="Meno"
20791="Parametre"

; Advanced page
20800="Názvy okien:"
20801="Použiť popisy z hlavného okna programov"
20802="Pokročilé nastavenia vzhľadu:"
20803="Odstrániť záhlavie TaskSwitchXP okna"
20804="Odstrániť stavový riadok"
20805="Akcie tray ikony:"
20806="Kontextová ponuka:"
20807="Nastavenie:"
20808="Zoznam okien všetkých aplikácií:"
20809="Zoznam okien aktívnej aplikácie:"
20810="Nastavenia konfigurátora:"
20811="Zobraziť okno konfigurátora vždy navrchu"
20812="Zapamätať si pozíciu okna konfigurátora"
20813="Zapamätať si poslednú stránku nastavenia"
20814="Spustiť TaskSwitchXP pri spustení/zatvorení"

; Tray icon actions
20890="Žiadne"
20891="Ľavé kliknutie"
20892="Ľavé dvojkliknutie"
20893="Kliknutie stredným tlačítkom"
20894="Dvojkliknutie stredným tlačítkom"
20895="Pravé kliknutie"
20896="Pravé dvojkliknutie"


; About page

; Information about you: contact email, website, etc.
; PLEASE NO COMMERCIAL ADS, ONLY YOUR PERSONAL INFORMATION!!!
;
; You can place here a text with two links in HTML format:
;   1) <a id=\"idTranslatorHome\" href=\"http://www.ntwind.com\">homepage</a>
;   2) <a id=\"idTranslatorMail\" href=\"mailto:alexander@ntwind.com">e-mail</a>
; Don't forget about special characters (like as \" and \\) in HTML tags, and 
; check out your links!
;
; You can also place here a salutation for TaskSwitchXP users!  ;)

20900="Preložil <a id=\"idTranslatorMail\" href=\"mailto:peter.vavro@gmail.com\"><Gudas></a>\r\n...Rudina (Slovakia) 5.7.2005"


; Exclusions dialog
22000="Výnimky TaskSwitchXP"
22001="OK"
22002="Zrušiť"
22003="Aktívne aplikácie:"
22004="Obnoviť"
22005="Meno výnimky:"
22006="Vylúčiť podľa:"
22007="Mena procesu:"
22008="Triedy okna:"
22009="Mena okna:"
22010="Vylúčiť z:"
22011="Náhľadu zobrazenia"
22012="Zobrazenia okna v zozname"
22013="Povolené"

22090="" ; not excluded
22091=">> vylúčené z náhľadu"
22092=">> vylúčené zo zoznamu"

; Configurator Errors
30000="Chyba TaskSwitchXP konfigurátora"
30002="Nie je možné spustiť TaskSwitchXP.exe! Skontrolujte inštaláciu TaskSwitchXP."
30003="Nie je možné uložiť nastavenia do registrov.Skontrolujte svoje prístupové práva."
30004="Nie je možné načítať nastavenia zo súboru."
30005="Nie je možné načítať nastavenia zo súboru. Boli vrátené pôvodné nastavenia."
30006="Nie je možné uložiť nastavenia do súboru."

; Hints for exclusion dialog
30100="Nepomenovaná výnimka"
30101="Prosím zadajte názov výnimky."
30102="Žiadne parametre"
30103="Prosím zadajte parametre výnimky."
30104="Žiaden názov procesu"
30105="Prosím zadajte názov procesu."
30106="Žiadna trieda okna"
30107="Prosím zadajte triedu okna."

; Confirmations
30900="TaskSwitchXP potvrdenie"
30901="TaskSwitchXP detekoval že viac ako jeden monitor je aktívny.\r\nChcete povoliť \"Window\" mód náhľadu aby ste mohli zobraziť všetky náhľady z druhého monitora(ov)?"


; TaskSwitchXP Language Strings

; Tray menu
31000="Zoznam okien všetkých aplikácií"
31001="Zoznam okien aktívnej aplikácie"	
31002="Nastavenia..."
31003="Zavrieť"

31020="Rýchle nastavenia"
31021="Skryť tray ikonu"
31022="Nahradiť Alt-Tab"
31023="Povoliť prepínač okien aktívnej aplikácie"
31024="Povoliť zobrazenie TaskSwitchXP okna po uvoľnení Alt-Tab"
31025="Nevynútené nahradenie klávesových skratiek"
31026="Nová výnimka..."

31050="Pomoc"
31051="Dokumentácia"
31052="Domovská stránka"
31053="O TaskSwitchXP..."

; Tray menu for minimized applications
31090="TSXP: %d app(s)"
31091="Obnoviť všetko"
31092="Minimalizovať všetko"
31093="Zavrieť všetko"
31094="Obnoviť"
31095="Minimalizovať"
31096="Zavrieť"

; Task List menu
31110="Prepnúť"
31111="Minimalizovať"
31112="Minimalizovať do tray"
31113="Kaskáda"
31114="Uložiť Horizontálne"
31115="Uložiť Vertikálne"
31116="Obnoviť"
31117="Maximalizovať"
31118="Zavrieť"
31119="Ukončiť proces"

; Common menu
31150="Zobraziť info o procese"
31151="Vybrať všetko"
31152="Nevybrať nič"
31153="Odstrániť vybraté"
31154="Usporiadať podľa názvu"
31155="Usporiadať podľa aplikácie"	

; Process Info mask
; Here are used some terms from Windows Task Manager (Ctrl+Shift+Esc, Processes ; tab, View->Select Columns...)!
; WARNING: Don't replace %x special characters!!!
31500="Názov procesu:  %s\r\nID procesu:  %u\r\n\r\nTrvanie:  %u:%02u:%02u\r\nČas CPU:  %u:%02u:%02u\r\n\r\nVyužitie pamäti:  %uK\r\nVeľkosť virtuálnej pamäte:  %uK"
31501="N/A" ; Informácie o procese sú nedostupné...

; Confirmations
31900="Potvrdenie TaskSwitchXP"
31901="TaskSwitchXP je už spustené. Chcete ho zastaviť?"
31902="Ste si istý že chcete zavrieť TaskSwitchXP?"
31903="TaskSwitchXP detekoval že je spustený Ms PowerToy TaskSwitcher.\r\nChcete ho zrušiť?"

; Errors
32000="Chyba TaskSwitchXP"
32002="Inicializácia neúspešná."
32003="Nie je možné nainštalovať nevynútené nahradenie klávesových skratiek."
32004="Nie je možné registrovať klávesovú skratku Alt+Tab alebo Alt+Shift+Tab.\r\nMožno ju už má zaregistrovaná iná aplikácia."
32005="Nie je možné registrovať klávesovú skratku Ctrl+Alt+Tab alebo Ctrl+Alt+Shift+Tab.\r\nMožno ju už má zaregistrovaná iná aplikácia."
32006="Nie je možné spustiť ConfigTsXP.exe! Skontrolujte inštaláciu TaskSwitchXP."

32500="Nie je možné zaregistrovať klávesovú skratku:\r\n\r\nMeno: %s\r\nModifikátory: %02X\r\nVirtuálny kód: %02X"
32501="Zavrieť TaskSwitchXP"
32502="Zobraziť/Skryť tray ikonu"
32503="Nastaviť TaskSwitchXP"
32504="Zoznam okien všetkých aplikácií"
32505="Zoznam okien aktívnej aplikácie"
32506="Minimalizovať okno do tray"
32507="Obnoviť z tray"
